Revit 2026 API

# HostObjectSubcomponentInfoDepth Property

---

The depth of the roof or floor slab.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Depth { get; }
```
```vb
Public ReadOnly Property Depth As Double
	Get
```
```cpp
public:
property double Depth {
	double get ();
}
```
```fsharp
member Depth : float with get
```

#### Property Value

Double

The depth is the thickness of the slab as measured perpendicular to the slab's main faces, as opposed to the vertical extrusion distance.

#### Reference

HostObjectSubcomponentInfo Class

Autodesk.Revit.DB.IFC Namespace